src/DataProcessors/инкПечатьРКО/инкПечатьРКО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>инкПечатьРКО</name>
  <attributes>
    <name>ВедомостьНаВыплатуЗарплаты</name>
    <type>
      <types>DocumentRef.инкВедомостьНаВыплатуЗарплаты</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/Documents/инкВедомостьНаВыплатуЗарплаты/инкВедомостьНаВыплатуЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>инкВедомостьНаВыплатуЗарплаты</name>
  <attributes>
    <name>ВидВедомости</name>
    <type>
      <types>EnumRef.инкВидВедомостиНаВыплатуЗарплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.инкНачислениеЗарплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗарплатныйПроект</name>
    <type>
      <types>CatalogRef.инкЗарплатныеПроекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРеестра</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.инкОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.инкПодразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВыплатыЗарплаты</name>
    <type>
      <types>EnumRef.инкСпособыВыплатыЗарплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматОбменаСБанкамиПоЗарплатнымПроектам</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Зарплата</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.инкСотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>КВыплате</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыУдержаний</name>
    <attributes>
      <name>Удержание</name>
      <type>
        <types>ChartOfCalculationTypesRef.инкУдержания</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/DataProcessors/инкПечатьРКО/Forms/Форма/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ВедомостьНаВыплатуЗарплаты = Документы.инкВедомостьНаВыплатуЗарплаты.НайтиПоНомеру("00000000001",Дата("20220101000000"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьРКО(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПечатьРКОЗавершение", ЭтотОбъект);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("АдресПараметровВХранилище", ВыборСпискаСотрудниковВХранилище());
	
	ОткрытьФорму("ОбщаяФорма.инкВыборСотрудниковСписком", 
		ПараметрыОткрытия,
		ЭтотОбъект,
		УникальныйИдентификатор,
		,
		,
		Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры  

&НаКлиенте
Процедура ПечатьРКОЗавершение(Знач РезультатРедактирования, Знач ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатРедактирования) Тогда
		
		ТабличныйДокумент = ПолучитьТабличныйДокумент(РезультатРедактирования); 
		инкОтчетыКлиент.ПечатьТабличногоДокумента(ТабличныйДокумент,"РКО",ЭтаФорма);
		
	КонецЕсли;	
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьТабличныйДокумент(РезультатРедактирования)
	
	РезультатВыбора = ПолучитьИзВременногоХранилища(РезультатРедактирования);
	МенеджерПечати = РеквизитФормыВЗначение("Объект");
	ТабличныйДокумент = МенеджерПечати.ПолучитьПечатныйДокументРКОНаСервере(Объект.ВедомостьНаВыплатуЗарплаты,РезультатВыбора.Сотрудники);
	
	Возврат ТабличныйДокумент; 
	
КонецФункции

&НаСервере
Функция ВыборСпискаСотрудниковВХранилище()
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("Сотрудники",Объект.ВедомостьНаВыплатуЗарплаты.Зарплата.Выгрузить().ВыгрузитьКолонку("Сотрудник"));
	
	Возврат ПоместитьВоВременноеХранилище(ПараметрыРасчета, УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти
